# Стандартная
BG_COLOR = (174, 212, 180)
SNAKE_COLOR = (97, 150, 127)
FOOD_COLOR = (205, 92, 92)
TEXT_COLOR = (71, 71, 71)
BORDER_COLOR = (225, 171, 153)
SCORE_BG_COLOR = (204, 232, 213)

# Океан
# BG_COLOR = (102, 153, 204)  # Светло-голубой фон
# SNAKE_COLOR = (41, 128, 185)  # Насыщенный синий для змейки
# FOOD_COLOR = (155, 89, 182)  # Фиолетовый оттенок для еды
# TEXT_COLOR = (236, 240, 241)  # Светло-серый для текста
# BORDER_COLOR = (52, 73, 94)  # Тёмно-серый для рамки между игровым полем и полем счета
# SCORE_BG_COLOR = (189, 195, 199)  # Серый цвет фона для score_surface

# Закат
# BG_COLOR = (244, 208, 163)  # Оранжевый закат
# SNAKE_COLOR = (207, 102, 121)  # Розовато-красный
# FOOD_COLOR = (140, 81, 94)  # Темно-бордовый
# TEXT_COLOR = (99, 110, 114)  # Темно-серый
# BORDER_COLOR = (44, 62, 80)  # Темно-синий
# SCORE_BG_COLOR = (236, 240, 241)  # Светло-серый

# Лесная поляна
# BG_COLOR = (182, 216, 191)  # Светло-зеленый
# SNAKE_COLOR = (39, 174, 96)  # Насыщенный зеленый
# FOOD_COLOR = (235, 152, 78)  # Оранжевый
# TEXT_COLOR = (44, 62, 80)  # Темно-синий
# BORDER_COLOR = (236, 240, 241)  # Светло-серый
# SCORE_BG_COLOR = (189, 195, 199)  # Серый

# Приглушенные тона
# BG_COLOR = (236, 240, 241)  # Светло-серый
# SNAKE_COLOR = (149, 165, 166)  # Серый
# FOOD_COLOR = (52, 73, 94)  # Темно-синий
# TEXT_COLOR = (44, 62, 80)  # Темно-синий
# BORDER_COLOR = (189, 195, 199)  # Серый
# SCORE_BG_COLOR = (182, 216, 191)  # Светло-зеленый
